roles = {
    0: {"name": "Не авторизован", "emoji": ""},
    1: {"name": "Специалист", "emoji": "👤"},
    2: {"name": "Руководитель", "emoji": "👑"},
    3: {"name": "Дежурный", "emoji": "👮‍♂️"},
    4: {"name": "Администратор", "emoji": "🛡️"},
    5: {"name": "ГОК", "emoji": "🔎"},
    6: {"name": "МИП", "emoji": "📝"},
    10: {"name": "root", "emoji": "⚡"},
}

russian_months = {
    1: "январь",
    2: "февраль",
    3: "март",
    4: "апрель",
    5: "май",
    6: "июнь",
    7: "июль",
    8: "август",
    9: "сентябрь",
    10: "октябрь",
    11: "ноябрь",
    12: "декабрь",
}

russian_months_nominative = {
    1: "Январь",
    2: "Февраль",
    3: "Март",
    4: "Апрель",
    5: "Май",
    6: "Июнь",
    7: "Июль",
    8: "Август",
    9: "Сентябрь",
    10: "Октябрь",
    11: "Ноябрь",
    12: "Декабрь",
}

russian_months_genitive = {
    1: "января",
    2: "февраля",
    3: "марта",
    4: "апреля",
    5: "мая",
    6: "июня",
    7: "июля",
    8: "августа",
    9: "сентября",
    10: "октября",
    11: "ноября",
    12: "декабря",
}

russian_weekdays_short = {
    0: "Пн",
    1: "Вт",
    2: "Ср",
    3: "Чт",
    4: "Пт",
    5: "Сб",
    6: "Вс",
}

months_emojis = {
    "январь": "❄️",
    "февраль": "💙",
    "март": "🌸",
    "апрель": "🌷",
    "май": "🌻",
    "июнь": "☀️",
    "июль": "🏖️",
    "август": "🌾",
    "сентябрь": "🍂",
    "октябрь": "🎃",
    "ноябрь": "🍁",
    "декабрь": "🎄",
}

exchange_emojis = {
    "active": "🟢",
    "inactive": "🟡",
    "sold": "💰",
    "canceled": "🔴",
    "expired": "⏳",
}
