roles = {
    0: {"name": "Не авторизован", "emoji": ""},
    1: {"name": "Специалист", "emoji": "👤"},
    2: {"name": "Руководитель", "emoji": "👑"},
    3: {"name": "Дежурный", "emoji": "👮‍♂️"},
    4: {"name": "Администратор", "emoji": "🛡️"},
    5: {"name": "ГОК", "emoji": "🔎"},
    6: {"name": "МИП", "emoji": "📝"},
    10: {"name": "root", "emoji": "⚡"},
}

russian_months = {
    1: "январь",
    2: "февраль",
    3: "март",
    4: "апрель",
    5: "май",
    6: "июнь",
    7: "июль",
    8: "август",
    9: "сентябрь",
    10: "октябрь",
    11: "ноябрь",
    12: "декабрь",
}
