role_names = [
    "Не определено",  # 0
    "Специалист",  # 1
    "Руководитель группы",  # 2
    "Дежурный",  # 3
    "Администратор",  # 4
    "Группа оценки качества (ГОК)",  # 5
    "Мониторинг и прогнозирование (МИП)",  # 6
    "Администратор в боте графиков",  # 7
    "Администратор в боте вопросов",  # 8
    "Администратор в боте ачивок",  # 9
    "root",  # 10
]

group_admin_titles = [
    "Неизвестно",  # 0
    "Спец",  # 1
    "РГ",  # 2
    "Дежурный",  # 3
    "Администратор",  # 4
    "ГОК",  # 5
    "МИП",  # 6
    "Администратор в боте графиков",  # 7
    "Администратор в боте вопросов",  # 8
    "Администратор в боте ачивок",  # 9
    "root",  # 10
]

executed_codes = {
    "Специалист": 1,
    "Руководитель": 2,
    "Дежурный": 3,
    "Администратор": 4,
    "ГОК": 5,
    "МИП": 6,
    "root": 10,
}

russian_months = {
    1: "январь",
    2: "февраль",
    3: "март",
    4: "апрель",
    5: "май",
    6: "июнь",
    7: "июль",
    8: "август",
    9: "сентябрь",
    10: "октябрь",
    11: "ноябрь",
    12: "декабрь",
}
